app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jon"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email_or_username, password)
    user = User.find_by_username(email_or_username)